#include <iostream>


int main(){
  std::cout << "Task_4" << std::endl;

  return 0;
}

// Вам даётся массив целых чисел, отсортированных по возрастанию. 
// Необходимо вывести его на экран отсортированным в 
// порядке возрастания модуля чисел
// Пример:
// Массив {-100,-50, -5, 1, 10, 15}
// Вывод: 1, -5, 10, 15, -50, -100

// Задание со звёздочкой: оптимизировать решение 
// четвёртой задачи, чтобы оно совершало 
// как можно меньше операций 